#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ItemUpgradeConfig_type.BP_STRUCT_ItemUpgradeConfig_type
// 0x0040
struct FBP_STRUCT_ItemUpgradeConfig_type
{
	int                                                ID_0_74823400740B386E7F557B4C095B0CF4;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GroupID_2_4E91F7403F208F5D7F4025C50C237414;               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CostItemNum3_3_4805B380606054CE0B74DB5A068FB003;          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemID_5_1A4F57C073BEACD924EAF6870D23FAD4;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CostItem2_6_407CA74002E8028108EC7D0C0F4068F2;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CostItemNum2_7_4804B340606054CD0B74DB59068FB002;          // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CostItem3_8_407DA78002E8028208EC7D0F0F4068F3;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemType_9_20217D006E9CA28C6D6121ED03F9CD45;              // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                EffectID_10_326047402DFFF91D0718A47C0590A444;             // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CostItemNum1_11_4803B300606054CC0B74DB58068FB001;         // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CostItem1_12_407BA70002E8028008EC7D0D0F4068F1;            // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Level_13_0CD78EC02A3BEF5B5310207200D0590C;                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FavourateItemID_14_7567630026AD12C45BA37EA604D70764;      // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     EffectBg_15_69612E407477C2010718A39C0590A417;             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

