#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RegionConfig_type.BP_STRUCT_RegionConfig_type
// 0x0059
struct FBP_STRUCT_RegionConfig_type
{
	struct FString                                     RegionName_0_6FD56A274264F9D23BF6E78649990B96;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RegionCode_1_5DC6C7FB4FECF18D480EFAA3DE14C386;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     NationLang_2_E7700BFA44598D0C74CD639FE4FC307D;            // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsNation_3_00FBDD66481A878845FE90B9489F0408;              // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     res_path_4_1CDB9AEE44DDB2ADB7DB72921E8181A7;              // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     sort_key_5_CBE9558C47B42D474F2C8F9D0A3E0021;              // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     channels_7_1FF007005FFA1D9A6400BA67081DEF53;              // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     reserveSpeed_8_0F578F4067C2058558E70C3208D08F84;          // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               saveDataSwitch_9_6EE31AC02D136BA30297A2D5081D0658;        // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

