#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_character_exchange_type.BP_STRUCT_character_exchange_type
// 0x0018
struct FBP_STRUCT_character_exchange_type
{
	int                                                item_num2_0_7CF7BD406D89D4B904F5E0210E456FF2;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num1_1_7CF6BD006D89D4B804F5E02E0E456FF1;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id1_3_5C375C405C950DC1341CF4420FE44C21;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id2_5_5C385C805C950DC2341CF4410FE44C22;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_6_2E2E50004F3CC3702C6ADBC305FE44C4;               // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sort_id_8_6C59D6403872E56F1451E0390D3F94C4;               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

