#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_VehicleRefitStyle_type.BP_STRUCT_VehicleRefitStyle_type
// 0x0084
struct FBP_STRUCT_VehicleRefitStyle_type
{
	int                                                cost_id1_21_40D3BDC00FA1EC252A325218091B0AE1;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cost_id2_2_40D4BE000FA1EC262A325219091B0AE2;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                auto_unlock_3_70A1E14054C1515F34AD00AA03FE271B;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                part_id_19_2960F1004F796BBC287325E80772B0B4;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                part_group_id_20_580314001313FC7E5037A1C0001EF544;        // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                style_id_6_3334EF8009D542BA023C1EFF04520144;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                vehicle_group_id_7_2FA91E401396E1572443357005BAE444;      // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cost_num2_8_567B5EC042ECFAD5581D19B001B10392;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cost_num1_9_567A5E8042ECFAD4581D19B101B10391;             // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     style_icon_10_2B88068062961F24124419A202014E0E;           // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part_name_11_242D66002BB47CD41AA53D3702B10145;            // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part_group_icon_12_75E1AB0010031F6A4A4800D10EF54A4E;      // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     style_name_13_7772E4800830FFC6124AFDB20202F465;           // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                value1_14_12B54BC05132BBB9260C3FBC04D988D1;               // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                value2_15_12B64C005132BBBA260C3FBF04D988D2;               // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                real_part_16_420F46C07AAD2FE77C0DB8570D3321D4;            // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                type2_17_243BF54066D327F75079C483054BFDB2;                // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                type1_18_243AF50066D327F65079C482054BFDB1;                // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                can_fit_22_68F7CD4000E30BD17923736E08996A54;              // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     part_group_tab_icon_23_089B9080591DEC3273FD6659077B104E;  // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                real_part2_24_0189F34001B6E9815CB7C17003321DA2;           // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                type21_25_7B46618009DF2DB0732EC53204BFDB01;               // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                value21_26_048158402E894EF74D0737BF0D988D11;              // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

