#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_AvatarSlotTable_type.BP_STRUCT_AvatarSlotTable_type
// 0x0080
struct FBP_STRUCT_AvatarSlotTable_type
{
	int                                                SlotID_0_07B16B8074758AC65DD345920E3BDC84;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TemplateID_1_2691320079AF0A7A6A1748830376BD24;            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     RecoverReplaceFlagsWhenSelfHidden_2_1E3059803295C22634A0ED8E0030856E;// 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     HideFlags_3_237919800A408D2A273633DC01DAD293;             // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ConflictConfig_4_4BB661C01D3BCD3F6F3FB665067D3C67;        // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RecoverReplaceFlagsWhenSelfReplaced_5_1EC56E80372E83625B067765035DA8E4;// 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RecoverHideFlagsWhenSelfHidden_6_6B26A900172EBB763595428E0B36164E;// 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ReplaceFlags_7_2D4E8A0019E3B1AC0C7FEA5807A9C1C3;          // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RecoverHideFlagsWhenSelfReplaced_8_1D3C3E0039C7C5D033D65C0505EE83E4;// 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SubSlotID_9_5DE936007C7E6AFA71E4CC580CE889E4;             // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ConflictConfigWhenSelfReplaced_10_426690C043D8722F5C5A3A8F03A0F1A4;// 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     HideBoneNames_11_774C9C40779C7AFB2332C67001F5BD73;        // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                HideBoneType_12_394DA7C05E9425853B3A77F80B1DBD85;         // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HideBoneSlotID_13_7901AB002CDD9D2C1F43E7310DA083C4;       // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

