#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_GoldenSuitMapCfg_type.BP_STRUCT_GoldenSuitMapCfg_type
// 0x002C
struct FBP_STRUCT_GoldenSuitMapCfg_type
{
	int                                                AcceptID_0_37D007C06284B9935018648F052EEE94;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ExchangeID_2_5A777C8047534EA4004FAEED0CF22BF4;            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Period_3_184AA94068E2092F7F0475F307503EC4;                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     InviteeActionID_12_5492C04044A14FB51C22E421028D9634;      // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                InviterActionID_6_14F2C3805AA4F4A224E836A6028E0934;       // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TeamupActionID_7_3DCD264060C758FB3D51A0980D7A1134;        // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BattleActionID_8_2462A24025FC500376EA39190EA7FD14;        // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                InviteTextID_10_287C18C03E5ECD896573262E0C757AE4;         // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                OtherTeamupActionID_11_716546C055AD8FBB73578527048F8874;  // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

