#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ReddotConfig_type.BP_STRUCT_ReddotConfig_type
// 0x0044
struct FBP_STRUCT_ReddotConfig_type
{
	int                                                ID_0_78AF56C044BEFD412EE9515D060FED24;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsEliminatePrimaryReddot_1_27D0FA0036EB83B630125A6C0410D674;// 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	struct FString                                     Name_2_5B5613C00DB5AED7351999A70FEEB235;                  // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Weight_3_4E71ED804B30B13256D9FD060C2DF214;                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Icon_4_0F6B35C02E0DDE1F3533E61A0FED105E;                  // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               Switch_5_77A6D00006137FAC601C15940C5C0578;                // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	int                                                ValidLevel_6_6FEECD801D03127225565A3C007EFE9C;            // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ValidUser_7_108A3740653B25C774ABC29402070AE2;             // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     UIName_8_6FCB1B40222605A726FB887E0C6C49D5;                // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

