#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_BetterVehicleEffect_type.BP_STRUCT_BetterVehicleEffect_type
// 0x00AC
struct FBP_STRUCT_BetterVehicleEffect_type
{
	int                                                BornFall_0_699F66401857D3717272C3F90C031E0C;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     EnterTeamVideo_1_439821406CC04453172EAC6100F15A2F;        // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_6258A58050DEEC1C34CC36960D71DA44;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Parachute_3_58CF69800AF0CE4447FE852D0F6443F5;             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VehicleMusic_4_0E3A12801F42C31E41988F0109D257A3;          // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ParachuteVehicle_5_266D99802E2F69A84C03D52C0AFAC775;      // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     VehicleContainer_6_0FC11B00763F5CF0333D88620BFE3412;      // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     VehicleInBornIsland_7_536A1B00296E6F2C6F6CE5DA0FA35564;   // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GiftPreview_14_558C5D4070F33535251D5E080A28E547;          // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetQualityImage_16_035D5D4050366A773BD94FF4054AD0C5;      // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetVehicleImage_17_062453006ABB76D04A9785020C4A7C45;      // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetShareGiveVersion_18_142EC3404FFEDF7558828BCC004D11DE;  // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GiftPreviewShadow_19_1C8416C067541F557648D1C906B6A027;    // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetQualityImage2_20_1034C9C00A93CC5131F91D5B04AD0CD2;     // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     VehicleInSocialIsland_21_2A6CAD80415C40A2077B867D0B8A25A4;// 0x0088(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShareQualityImage_22_107532001D3220D2428BC2110CE56945;    // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PropertyForParachute_23_5D8FAC8075FF989E5B7DDD4703989875; // 0x00A0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

