#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_UPassOrdinaryRewardCfg_type.BP_STRUCT_UPassOrdinaryRewardCfg_type
// 0x0054
struct FBP_STRUCT_UPassOrdinaryRewardCfg_type
{
	int                                                item_num_3_0_58140BC0141A9A29093476690B708A53;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                show_buy_1_288B0BC079CF19E12D3C417100B56CA9;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_2_2_58130B80141A9A28093476680B708A52;            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_1_3_7DADAFC075BA33E71E3AA8B90DFC58E1;      // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_4_396695C018C2A43F7EB9FBA0035ED13C;                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_expire_time_3_5_2C299E802F31320C7CD1A2170F924AF3;    // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_6_1A2FB300601D596668884C4901D83614;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_1_7_79EA4A8028C1774C14C1003A07B6A691;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_2_8_79EB4AC028C1774D14C1003D07B6A692;             // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_expire_time_4_9_2C2A9EC02F31320D7CD1A2160F924AF4;    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_3_10_7DAFB04075BA33E91E3AA8BB0DFC58E3;     // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_3_11_79EC4B0028C1774E14C1003C07B6A693;            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_index_12_40DF4FC04030662D72C9BB68070618B8;         // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_expire_time_1_13_2C279E002F31320A7CD1A2290F924AF1;   // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_4_14_7DB0B08075BA33EA1E3AA8BA0DFC58E4;     // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_4_15_58150C00141A9A2A0934766A0B708A54;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_4_16_79ED4B4028C1774F14C1003F07B6A694;            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_expire_time_2_17_2C289E402F31320B7CD1A2280F924AF2;   // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                spec_show_18_7343628039FCCB48034FE4F90615C917;            // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_2_19_7DAEB00075BA33E81E3AA8B80DFC58E2;     // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_1_20_58120B40141A9A27093476770B708A51;           // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

