#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TxMissionMapMode_type.BP_STRUCT_TxMissionMapMode_type
// 0x0030
struct FBP_STRUCT_TxMissionMapMode_type
{
	int                                                IsDefault_1_60FF1A001E02FF964E6DDC2D05E252E4;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MapID_3_1802048073B979802E7096C60ED92B84;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_8_5FA9BA0030E3436445DDF0B205EDEEC5;                  // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Prestige_9_5D990A80713AE524270F7137023F4205;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Worth_11_7FDEFEC007C262D128DE42D50ED8C6F8;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DescID_12_6C483CC039E901DD5FDD82FC0C066234;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ModeID_13_43A8BE401B4532157985E7880DAF5C34;               // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ModeType_14_74846380625428FE6F82CCD60F5F6DC5;             // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TicketID_15_56E2160063678596591B4DD0057425D4;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TicketNum_16_1E0EDEC07147CF7F60B400E0074265ED;            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

