#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_UPassLevelAwardGroupCfg_type.BP_STRUCT_UPassLevelAwardGroupCfg_type
// 0x0064
struct FBP_STRUCT_UPassLevelAwardGroupCfg_type
{
	int                                                item_expire_time_1_0_371D8FC03E5981F12C2FF0940562CF31;    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_4_1_08B062403C9935573FFF97790A368864;      // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_expire_time_3_2_371F90403E5981F32C2FF0920562CF33;    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_index_3_713281802114C2326C8A13840DF69B78;          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_effect_4_4_734D8D0066BB44B831C5005C0A26E104;    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                show_price_5_0CB12E4011B62E997891462706983FA5;            // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_effect_1_6_734A8C4066BB44B531C500590A26E101;    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_effect_3_7_734C8CC066BB44B731C5005F0A26E103;    // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_4_8_2DB1FDC0006CA8913FD0C3120CBA9AD4;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_effect_2_9_734B8C8066BB44B631C5005E0A26E102;    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_2_10_08AE61C03C9935553FFF977F0A368862;     // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_2_11_6AD51C8059FA1E920D7CCAAA0FCA0B92;            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_3_12_2DB0FD80006CA8903FD0C3110CBA9AD3;           // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_3_14_08AF62003C9935563FFF97780A368863;     // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_4_15_6AD71D0059FA1E940D7CCAA80FCA0B94;            // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_2_16_2DAFFD40006CA88F3FD0C3100CBA9AD2;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                discount_price_17_553F584004E6726D7042531209A61965;       // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_type_1_18_08AD61803C9935543FFF977E0A368861;     // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_expire_time_2_19_371E90003E5981F22C2FF0950562CF32;   // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_3_20_6AD61CC059FA1E930D7CCAA90FCA0B93;            // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                price_type_21_421E2E80611762FA6F98174D006A09C5;           // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_expire_time_4_22_372090803E5981F42C2FF0930562CF34;   // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_num_1_23_2DAEFD00006CA88E3FD0C31F0CBA9AD1;           // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_id_1_24_6AD41C4059FA1E910D7CCAAB0FCA0B91;            // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_25_5673A4C0792C15C563165B8B0159FCE4;                   // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

