#pragma once

// PlayerUnknown's Battle Ground Mobile (1.5.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_AvatarInit_type.BP_STRUCT_AvatarInit_type
// 0x0074
struct FBP_STRUCT_AvatarInit_type
{
	int                                                AvatarType_0_3534FC1C4847D29CB382D487161E0C39;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Sex_1_DE7B4A914EA58399950DA9A557E8D0FE;                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BodyID_3_D0F2F90844980E5CFC15088116ED155E;                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                id_4_1149D5AD4F63BCC54D2D7A8BBC0CA799;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Race_19_DF2B2B34464EC67801C8128451969320;                 // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ResetCost_6_9819BFBD4323ABBA263E648E6215E7AA;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ForeverCost_7_B479AB834F40E958B1E09AB2A68787D5;           // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AvatarName_8_222CFDFE43D22AB81AD656B52466F586;            // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AvatarIcon_9_41BF964E461DECB1464E3D81D71D0BA6;            // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MonthCost_10_2B9D996440F8382C074285B5FBCD9C3B;            // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HairColor_11_A1E301C14C09FC2B33533C91173418A4;            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SevenCost_12_20DC7F664112AC12F536C9A96999A78A;            // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Hair_18_8AA5656E47336F3D9A3F818181615EDD;                 // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sort_15_482B740E408DD3A4B6B9519926C84F00;                 // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     FemaleAvatarIcon_20_284C6EC00913C43136EAF2080455B91E;     // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AcquireMode_21_3934F60056698CC462B989D10F2FF285;          // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RoyalePassSeason_22_11765D406DE77567238CB547064A71FE;     // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BeardColor_23_7B29798029BE5C8A33BF47960274EF12;           // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BeardType_24_0FDD824043B0702770E1DA2B072628A5;            // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

