#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TxMissionSegment_type.BP_STRUCT_TxMissionSegment_type
// 0x0060
struct FBP_STRUCT_TxMissionSegment_type
{
	struct FString                                     BigIcon_0_4608AC8012716CDC3747299A01C579EE;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Level_1_6191E3C0068E3A8D5DDB036301CBF23C;                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_2_6A18860057AD3D18360D6868081CD5D5;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NeedExp_3_446570000C1247F02C069ECD0D850D30;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SmallIcon_4_6A84264068762909100EA7940AB1595E;             // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sort_5_20C98FC00C92E291363E7A61081A1574;                  // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SubIcon_6_4BD6F2806BBFBAAA5C82C8B9038879FE;               // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TypeID_7_00F6B18008D173F03A790EF00A3381C4;                // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TypeName_8_474AAE8070EFBBA06EA8FFA303825E05;              // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                K_13_4085F8802E2653CE4DD7973E093E81BB;                    // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              adjust_factor1_f_14_3515BD804D2856C2108217C40E27E1D6;     // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              adjust_factor2_f_15_0F2E7DC06EF247C910820AAF0E27E2D6;     // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              B_high_f_16_6C4E874021C851155CACB7620607C7A6;             // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              B_low_f_17_6FC833C01AABEB6541BA2BFA0F7DEEE6;              // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

