#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LoginRes_type.BP_STRUCT_LoginRes_type
// 0x0040
struct FBP_STRUCT_LoginRes_type
{
	struct FString                                     BeginTime_0_61E8AB401E0B8B054798D4B700EA1325;             // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EndTime_1_75DE77C05915E9FF6F6F79DB0FE48785;               // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_500551805D3D3EB8005C1DB60AD29B84;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ResPath_3_6DF67C00770BC06671BECC720D654108;               // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BGMPath_4_459C2700734E2FA214B5EDF7032F4118;               // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TexPath_5_02397DC0325EB369387098470F604108;               // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

