#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_gl_login_loading_table_type.BP_STRUCT_gl_login_loading_table_type
// 0x002C
struct FBP_STRUCT_gl_login_loading_table_type
{
	struct FString                                     end_time_0_15B79280647E52F406E63E410408E255;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                id_1_5AB5D4804C4AF3344AD3D508076E4E14;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                weight_2_7B7CE340195FCD251E7B282F0F3C93B4;                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     begin_time_3_2B85060054A67186088ECEFE0288C485;            // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     path_4_4B8D2C80495755DA2E7788140E4F8FC8;                  // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

