#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LoadingResourceConfig_type.BP_STRUCT_LoadingResourceConfig_type
// 0x0038
struct FBP_STRUCT_LoadingResourceConfig_type
{
	struct FString                                     begin_time_0_0EC8014070B48F3525879F5F0E31CFE5;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     end_time_1_09FDCDC0596A0DC160D8CFCD0EA4B955;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     groups_2_4763248079AC892C2793871D07036E63;                // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                id_3_4585CFC01C9328B9068F51240A021714;                    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     path_4_4399E7C0726004CF009573C5021682A8;                  // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                weight_5_0C065E804AC03F1C454244BA0631FFE4;                // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

