#pragma once

// PlayerUnknown's Battle Ground Mobile (1.5.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ItemUpgradeUnLockConfig_type.BP_STRUCT_ItemUpgradeUnLockConfig_type
// 0x0014
struct FBP_STRUCT_ItemUpgradeUnLockConfig_type
{
	int                                                CostId_0_40B075400720914F338B21630836A664;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CostNum_1_078596002C3FF6502DCDCA64036A7C3D;               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GroupID_2_28884A400FB528EF5FAA0AD805962D54;               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_3_019807003046E3FC627D6444000E9864;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PartId_4_6975B4C027089FA77ADB2D5709D89664;                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

