#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ModeTabConfig_type.BP_STRUCT_ModeTabConfig_type
// 0x0088
struct FBP_STRUCT_ModeTabConfig_type
{
	struct FString                                     TabName_0_29BF28007932DF2E344C4A3A0CD7AB55;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_7A7B454077815BF16D05134A0A0ED7B4;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TabSort_2_607031C02E1884A7344B39A90CD78BF4;               // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_3_68A382405F66DB775C6577060ED82E35;                  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TabType_4_008B904056DC10A934A0EF860CD76D05;               // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Sort_5_1F548C00131A98F05C7518C50ED70C94;                  // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TabID_6_01D4AB00596A47F2185B66E80D6CD634;                 // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Icon_7_1CB8A4406456A2055C6865E00ED7945E;                  // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Desc_8_2EC381C0609574115F0A26A50ED7C693;                  // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                CanMulti_9_6FD70940310A039F5EB4BEFC0E3A7459;              // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsShow_10_1812B9401546E1A30953BA2D086291B7;               // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MapImageInLobby_11_03CE4E004ACE6DA608D4B1FE0C1DA029;      // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LogoPath_13_3C45A9806C7840E253B400850FEAB0F8;             // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TabShowType_14_2A35F88056A979940EEFC49E04007715;          // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TabValidSeason_15_177AFE0053987E0A58EF3E0C04E93E6E;       // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TagStr_16_40B1F74025A479F509D3A9C606CDC462;               // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ForceMulti_17_6F5780805D429A6A63CEB95007531F29;           // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SecTabName_18_6ACE6EC05DDE0E3310521A8E04A1B7B5;           // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

