#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_corps_race_act_result_reward_config_type.BP_STRUCT_corps_race_act_result_reward_config_type
// 0x00A8
struct FBP_STRUCT_corps_race_act_result_reward_config_type
{
	int                                                act_id_0_0F41BA404FE3F6911FEEFA840650B5A4;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                day_index_1_31254E804BBB7C66433234BC0E5B22E8;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                id_2_65D234800C7B94003BD3943A0A3056D4;                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     res_id1_3_483E2B001FBEB5843259C40A0A6C5A01;               // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     res_id2_4_483F2B401FBEB5853259C40B0A6C5A02;               // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     res_num1_5_15022BC05A10D70345C4D64F06C60DA1;              // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     res_num2_6_15032C005A10D70445C4D64006C60DA2;              // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     supplie_number_7_5D0A5BC0002AE37750474FF0041D40F2;        // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     valid_hours1_8_23B615807CBC9B343D7D3E2B0218D6B1;          // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     valid_hours2_9_23B715C07CBC9B353D7D3E2A0218D6B2;          // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jk_res_id1_10_0D8338007243DC644EAA6EA608A06421;           // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jk_res_id2_11_0D8438407243DC654EAA6E9908A06422;           // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jk_res_num1_12_6E90B8C00E1F70C545DC25000A07EF81;          // 0x0078(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jk_res_num2_13_6E91B9000E1F70C645DC25010A07EF82;          // 0x0084(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jk_valid_hours1_14_0EEAA28071406AA6591C31C800359551;      // 0x0090(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jk_valid_hours2_15_0EEBA2C071406AA7591C31CB00359552;      // 0x009C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

