#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponBPTable_type.BP_STRUCT_WeaponBPTable_type
// 0x0040
struct FBP_STRUCT_WeaponBPTable_type
{
	struct FString                                     CName_0_CD600C314161E84152102388BAC2C6E5;                 // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Path_1_4B3A115440CA4D3ED6BB1CAE5312F1D0;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_CE3ED80D47C51A8880AD2CBC79F2E6D0;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Wrapper_3_1417B6C029873FAD0DDBA26505064332;               // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LobbyPath_4_4623DFC03FE9DCA3544D323C06AB9278;             // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WeaponClass_6_06A7B680656FDD4E11BFC0FA01E01EC3;           // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

