#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_character_table_type.BP_STRUCT_character_table_type
// 0x0091
struct FBP_STRUCT_character_table_type
{
	int                                                id_1_0E3DFDC032F30C1D6B945CB00905AF94;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_7_11C5B2C04B9BE3AB70BC001105B02F35;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     default_suit_10_278B4CC06A4F20B556B8FFF90C646724;         // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                hair_11_7E53738028FF8CFA70B2C2F305AF8F02;                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     default_com_action_12_07C722807AA30AA25DD4A2C1091DC74E;   // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                head_13_6E816F0078267C8070B130CD05AF8274;                 // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gender_14_0C70C7C00A45EE7920862FF00FB34F62;               // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     default_sound_15_253505C057CBC2B33A066F2B0646BA84;        // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     default_total_action_17_50225BC06E17DFC33F2B3F42010124DE; // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     bg_path_18_3F973FC07FB80FB9276F730B0E663258;              // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     bg_text_19_490C45C079719881276124810E66F604;              // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                sort_id_21_0CA767801E5BF5A83A54BC7700F9DF04;              // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     bg_path2_22_48A56C403995D0E330A54D5F06632552;             // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     bg_path3_23_48A66C803995D0E430A54D5E06632553;             // 0x0074(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AvatarBg_25_18A60C806F1B5A946308EECC058F2B67;             // 0x0080(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                voice_bag_id_27_4B129D404AD95BED499CED2E0B3B49E4;         // 0x008C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               disable_box_28_672B498055D86CFC5DC3C37603D8C248;          // 0x0090(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

