#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_AliasCfg_type.BP_STRUCT_AliasCfg_type
// 0x00B4
struct FBP_STRUCT_AliasCfg_type
{
	int                                                AliasQuality_0_52D618C06710B4516E54A5DD02AC5C99;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AliasName_2_0717FEC012DC0CA124E0DCA506CEE7F5;             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AliasEndTime_3_1AF0C8006D3B07E2734D00920255C4E5;          // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AliasType_27_5DE467003EB70E1E24E47DFC06C221A5;            // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AliasDesc_5_4D37FE40140AA53B240D9F7006CD0D53;             // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AliasID_6_353C41C06C5EB41765F74FFE01C6CD74;               // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AliasGetDesc_7_6CA02640759BC685737AF47B07D4C043;          // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AliasJumpUrl_26_4BCF12400900E8A91D7221120BB8306C;         // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AliasIsShow_9_36BAB5C036E4D0695B3693210EA959A7;           // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AliasSortWeight_10_2EB1228029C7B6FE2B0FB3AC0F19BAA4;      // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AliasIconPath_11_012C44007A15BA423E8DD5FC09A5A5F8;        // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AliasValidTime_13_68567E40184F9DCB7CB207720E958A45;       // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AliasIconPathBig_28_6A4EE880765FA71E4C643DAD0A5F52A7;     // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AliasSubType_29_5D0C918043E47B58622B5B1800ABEC45;         // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AliasIconPathSmall_30_72E7A2401449F42D7EA8179D0F446E7C;   // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PopupImmediately_31_3378E600334574401D124023021D8169;     // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Material_32_17C52FC053A16C272D8413870638243C;             // 0x0080(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Model_33_246F604059C608314535BD6D0AB5B3FC;                // 0x008C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Texture_34_371C4040275E2709305AB3CA0D26F635;              // 0x0098(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AliasBroadCastTextID_35_372CA7C00E3146D349D1223800B8B3D4; // 0x00A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AliasIsBroadCast_36_124F0A407ABF176D28F9F4A90992FD54;     // 0x00A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AliasParamID_37_21F03E006336ED5E2352BE670C942DF4;         // 0x00AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                WarZoneType_38_5343DE006B9A53A0537B209D00F0EF05;          // 0x00B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

