#pragma once

// PlayerUnknown's Battle Ground Mobile (1.5.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MatchStrategyConfig_type.BP_STRUCT_MatchStrategyConfig_type
// 0x0040
struct FBP_STRUCT_MatchStrategyConfig_type
{
	struct FString                                     Desc_0_1AE24AC0623BDD896824788C02E57E03;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconPath_1_2C1D9080216C4A407DB9CD1D0CD18D88;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_37030E4025EEBED95B06465B0292E504;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IngameIconPath_3_307004C04D790D615A2293C00025B478;        // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsOpen_4_52623E8007CCD2844FE2999106D6F45E;                // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_5_54C24B407162A9AF6837A38D02E696A5;                  // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsDefault_6_4CB08B4002AAB1D91A4509480392E764;             // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UseScence_7_7A4AEA8067B3BB482830E18003B80525;             // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

