#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_PetActionTable_type.BP_STRUCT_PetActionTable_type
// 0x0074
struct FBP_STRUCT_PetActionTable_type
{
	int                                                PetID_7_6745CEC017101D417C9B58B90A755B44;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PetAnimRes_8_1054B74062846F873F7F61870FE97D73;            // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PetActionName_9_59EBE3401D89CA4B649608870B1AA8E5;         // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PetActionID_10_44C4A640765EB8DD578572F800DB1934;          // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PetActionIcon_11_0E01054077EEE9A96496CC090B191A8E;        // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PetActionScale_13_14B83D0078112AE64FD26A6101879B95;       // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PetActionOffset_14_563A3CC0122E069573D974410ABC02D4;      // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SortKey_15_4284558068BCA7003662F2D30BFA2BB9;              // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShowInLobby_17_19FCF54003CF4A8B499026D50669DDB9;          // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PetLevelSequence_18_620F97C0416DE81971E437D407E050C5;     // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MasterLevelSequence_19_7E9F6880389AC7D05D27B6F50E5E3325;  // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MasterActionID_20_41F257005172E64A6B5508ED0B3D43A4;       // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PetActionDes_21_4DEDCA007AFFDB12510AFD0F0DB194C3;         // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PetActionQuality_22_0B0B3D40109F72EB3D20AE6206BBA139;     // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     LobbyPetAnimRes_23_14DFB5407421995D3FD421710D4C3683;      // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NeedResetTransform_24_2D3D5000702BED64355585DF0DB7ED2D;   // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsShowInWorkshop_25_6C8D7D80144A232A340D11C70E5E4DE0;     // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

