#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_VehicleBPTable_type.BP_STRUCT_VehicleBPTable_type
// 0x002C
struct FBP_STRUCT_VehicleBPTable_type
{
	int                                                ID_0_0D9DF74051BBD583279703B701F172E4;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Path_2_2F72974026FE3BC32110651501735958;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CName_3_138BC5001BE2FE5E5E66B36807255925;                 // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                VehicleShapeID_4_2C43E38070C85DC025E56CC303F69884;        // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     LobbyPath_5_4594B5404A7DACE145FA22A607895AE8;             // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

