#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ModeTeamTable_type.BP_STRUCT_ModeTeamTable_type
// 0x0038
struct FBP_STRUCT_ModeTeamTable_type
{
	int                                                TeamId_1_53410F803B6D142223F831700D8D5A34;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ForbidTips_2_348BE0007F26AAEE38819A34033560C3;            // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     mapName_6_6BD132404199364D3429D1AC01E8FCC5;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sort_7_163A0C806525C7721036F7960BCDC0A4;                  // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                LabelStyle_8_759CFEC062B9ACB3170DC30F01D7BF95;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                LabelWords_9_3A699E405AEED4F11577CC6001D16903;            // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SubModeIDs_17_72C14E404114BF3F3B7A06F3099710D3;           // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MaxMember_18_79DAE2001FC5A7202E4AE0DD0088E932;            // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

