#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_rpIntroThirdSubTitle_type.BP_STRUCT_rpIntroThirdSubTitle_type
// 0x0040
struct FBP_STRUCT_rpIntroThirdSubTitle_type
{
	struct FString                                     BPPath_0_485AD2800A76E6125015100B09BFBBF8;                // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              endTime_f_1_5191CD804D14642A7968D10A049B83B6;             // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     imagePath_2_19554EC044A16CC12ABCAA1A0AEFDC38;             // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_center_aligin_3_63D76E800CADC1F608D98F6B0F9B8DFE;      // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	int                                                KeyIndex_4_72DFF300244C7CD2675066FF060D1018;              // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     localID_5_0F8C30C011AAA4C76FA1FE110FF45514;               // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              startTime_f_6_24B08B40086B58B5298F38540C0A40F6;           // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                textIndex_7_6258DA0048C9AD4E1BF5B04802BBECA8;             // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                x_8_4FE848C013D2DBBF10FB0C110CAD35A8;                     // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                y_9_4FE9490013D2DBC010FB0C120CAD35A9;                     // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

