#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_rpIntroSecSubTitle_type.BP_STRUCT_rpIntroSecSubTitle_type
// 0x0040
struct FBP_STRUCT_rpIntroSecSubTitle_type
{
	float                                              endTime_f_0_0C9A7580760F590A763D817D006C26E6;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     imagePath_1_545DF6C01802BCE1324CB31E0E1E7368;             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               is_center_aligin_2_0C141680099934C66C4C497B0385093E;      // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                KeyIndex_3_21BC9B00077A43B272CF168603440E88;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     localID_4_5C3CD8C000960637071CC16608A0C4F4;               // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              startTime_f_5_7611334047BE51952D3BC12B0DA16C06;           // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                textIndex_6_1D61820042F764EE4001276C064C45F8;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                x_7_4190F0C04E1A37DF40A99F6105F9C408;                     // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                y_8_4191F1004E1A37E040A99F6005F9C409;                     // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BPPath_9_5CDF7A803AEBF062305B79FA032AF4E8;                // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

