#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ArmoryConfig_type.BP_STRUCT_ArmoryConfig_type
// 0x0088
struct FBP_STRUCT_ArmoryConfig_type
{
	struct FString                                     Power_0_66023CC06166E049160058F001EA47E2;                 // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShotRange_1_59BA1C40037657B76427F9810CB9A205;             // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                WeaponID_2_04A777401625BC6D3B1E56BA09255CF4;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BulletID_3_7D8136C0262C958112A0BCFE0A90D7B4;              // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsShow_4_4C2F70C02E814ECD68323BF600FA3D47;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     VerticalRecoil_5_34839F80315AFB6669A7FB050FB382AC;        // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Shake_6_7E9B148046BA7452166E7E6601E6CE35;                 // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                WeaponType_7_482A1C8059A944560A6FD461055DA945;            // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ShootInterval_8_49712E00653738B65705EBAE034CD55C;         // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     HorizontalRecoil_9_1EB63B80354249506510039F02A0FBAC;      // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ReloadSpeed_10_13836B803042987230C406AD067DC2C4;          // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ClipCapacity_11_3EA5A7000BBA4130106249B307164639;         // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WeaponName_12_715DB4407742DAAB0A7C764D055D6F15;           // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ExtCapcity_13_128419002CEBB022532CC2890B99BD99;           // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

