#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_UnKnownPassPrePrizeTable_type.BP_STRUCT_UnKnownPassPrePrizeTable_type
// 0x0044
struct FBP_STRUCT_UnKnownPassPrePrizeTable_type
{
	int                                                BonusPoint1_0_32BF96002EE7025039619F17053858E1;           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BonusPoint2_1_32C096402EE7025139619F16053858E2;           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Cost_2_435ECBC05586E6B52691509605D4E924;                  // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GiftId_3_7ADD734011504EAF3C7F950604905D24;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Id_4_16FE30C04B665A1B01233E090F85D4B4;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SeasonId_5_3E5BAB002E21B9B442D798DC040D9724;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GiftItemId_6_38EC1700770A2DF21A386D580EDE31A4;            // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BuyReward_7_0E54CAC03DBED61908EA002206D195B4;             // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PhaseReward1_8_6F64C740292041AB3925FDAD0DEC8401;          // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PhaseReward2_9_6F65C780292041AC3925FDAC0DEC8402;          // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AppID_11_45B8B10072F3C8F67AF9AA0D0D4C8C84;                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

