#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CameraManager_EnlargeLensCameraData.BP_STRUCT_CameraManager_EnlargeLensCameraData
// 0x0014
struct FBP_STRUCT_CameraManager_EnlargeLensCameraData
{
	int                                                x_0_54D718C00EC8E57360A833000FE59A18;                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                z_1_54D919400EC8E57560A833020FE59A1A;                     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                y_2_54D819000EC8E57460A833030FE59A19;                     // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                rootCameraID_3_4BDC81405799F7715D41E7C907B0B4E4;          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                blendTime_4_25AA7FC03DFAD07B3A5018130FD3A8F5;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

