#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_UnknowPassBuyCfg_type.BP_STRUCT_UnknowPassBuyCfg_type
// 0x0040
struct FBP_STRUCT_UnknowPassBuyCfg_type
{
	struct FString                                     Desc2_0_67184800080A6DB06A7EAC820F5D4182;                 // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Desc1_1_671747C0080A6DAF6A7EAC810F5D4181;                 // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_67757F0013C6DC1C495D34BC088EF5A4;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BuyItemId_3_40A836C02092165B4D6E49EC06E5FFB4;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                buyType_4_7787F84001767BCD222963590E466F15;               // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShowItem2_5_5880B4407E043CB101B132840E6FE672;             // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShowItem1_6_587FB4007E043CB001B132850E6FE671;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BuyItem2Id_7_552003403C2CB6630C4AA70F0E5FE294;            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PassType_8_506C2A007989DA460C18BC5E00265475;              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsExtra_9_29876BC02D0F514F4413ED8007F414E1;               // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_flag_1_10_51EFD1C06DF303F91331863E0863D9B1;     // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_show_flag_2_11_51F0D2006DF303FA1331863F0863D9B2;     // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

