#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MainUISystem_type.BP_STRUCT_MainUISystem_type
// 0x0044
struct FBP_STRUCT_MainUISystem_type
{
	struct FString                                     Icon_0_03B291C04BB11B2759E00C5801457ADE;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     module_1_76F2710035AF78503318CAED08C53B65;                // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Switch_6_37122C00244F6DE432070410042E8BD8;                // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SystemID_3_261F74002FFF79506A8C2AAA002C05E4;              // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SystemName_4_5AA0F1005D9FB840508EFF3C0C067815;            // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Weights_5_2143A640346E27CD15B8D48905B7CBF3;               // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     UISwitch_8_4A73B3801F05CD246372584D0E2D4E88;              // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

