#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ItemSoundTable_type.BP_STRUCT_ItemSoundTable_type
// 0x0064
struct FBP_STRUCT_ItemSoundTable_type
{
	struct FString                                     EquipSound_0_068B68C066212493052EBF3305D63E14;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DropSound_1_4DD7CD003E11476C25039DA50902AA34;             // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_42F748C040D81BA3690F7C020EF58C44;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PickUpSound_3_0B99FAC07345086D4963B6D504877D14;           // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DropBank_4_1D8769C022E35E311709B3FF07910C6B;              // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EquipBank_5_30BCE58001E2251E07D41C7C055C432B;             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     UnEquipBank_6_4FF4964008C1F90F14F8C45904D7459B;           // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     UnEquipSound_7_0376B980772F43423C77A2D80D665704;          // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PickUpBank_8_3C7477801367726A5EFE3B0D0549773B;            // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

