#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SeasonChanllengeScore_type.BP_STRUCT_SeasonChanllengeScore_type
// 0x0014
struct FBP_STRUCT_SeasonChanllengeScore_type
{
	int                                                AbleScore_0_59A8570072C7DBC83E632DF1049AC0F5;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_1_6ACD7E403574E9A15F0F6EF10E6332C4;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxScore_2_727F838044C131860997172F06BAB5A5;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RankID_3_3DE4214049CEF5832BA23D27039A2CE4;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Rate_4_16315E000A16BB024FF9CFC7033396C5;                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

