#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FlagIDCfg_type.BP_STRUCT_FlagIDCfg_type
// 0x0030
struct FBP_STRUCT_FlagIDCfg_type
{
	struct FString                                     MinDist_6_0B46994033686B57353ADBF500714494;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ChatIDList_1_4EF37580641F954251E0DAFB019B9714;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                FlagType_2_11577240100B60A917DCD1AD0B460365;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FlagIndex_3_792107C04BF74D1D091F4261042C7A78;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TraceDist_7_58300C000EE7C4781954B3CD040DA8B4;             // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AlternateChatID_5_30B4D68067E6F79C260EA2C400C3E5D4;       // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

