#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MatchModeTable_type.BP_STRUCT_MatchModeTable_type
// 0x0050
struct FBP_STRUCT_MatchModeTable_type
{
	int                                                WordsToShowID_1_77E64C174AB6F7E74D2787AFEB973C94;         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_2_DEF610A441A2EE49E3D5F0A7283D9F12;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Mode_3_7AC60D7447253EA94CCECDB7E0A8DD80;                  // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DefaultChosen_4_AE6BFB154972A043172476BD6C55CCFA;         // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     WordsToShow_5_B8EE5A3A4C0C6424CC9589B21285E493;           // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PlayerNumStrID_7_3E731420498A594AACFB69A2C258EB4F;        // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ModeType_8_8181AFA046BFD77723D24BA680EF3650;              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxTeamPlayerNum_9_BA14F0DF41D5E63EA0553D909374D041;      // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ModeStr_13_45CE0B80353FD4DA650D7E610C295E22;              // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ModeWhenHide_15_7905A04042EFD4D92DF9053007807A35;         // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PersonPerspective_17_7D917C403D4EE16905E5C1940412E315;    // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ModeGroupID_18_24EB23C05C6547D152E8DD580A2AEDB4;          // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

