#pragma once

// PlayerUnknown's Battle Ground Mobile (1.5.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_VoiceIDCfg_type.BP_STRUCT_VoiceIDCfg_type
// 0x001C
struct FBP_STRUCT_VoiceIDCfg_type
{
	int                                                VoiceID_0_48A4CB003F48FFFE42A0594F0EE10D44;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Key_1_69717480416945426F45F0F40E949079;                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     VoiceDescription_2_51C808C03F575FA35673DB2509D489EE;      // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ActorID_3_2371CBC02184E3593CD431D50615F254;               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VoiceType_5_033BB0401751538F158BF27D010E3E85;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

