#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponDIYList_type.BP_STRUCT_WeaponDIYList_type
// 0x0140
struct FBP_STRUCT_WeaponDIYList_type
{
	struct FString                                     DefaultIcon_0_4CE794005B13840E212C9F540712CA7E;           // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DefaultStep_1_2EBBD8C05ABDC6AB26A8A87507139AE0;           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DIYMaxIcon_2_64E7A5C077C93D59588BD9A4095E807E;            // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DIYMaxLayer_3_7906C2C043F4BA497F8EB43905FAED52;           // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_4_6DDB83C03F8D67BD4620788B08CAD2D4;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_5_58C948C02DCFF62B0831A4090AD150F5;                  // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part1_6_6407DA803234F17C158654120D1605D1;                 // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part2_7_6408DAC03234F17D158654110D1605D2;                 // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part3_8_6409DB003234F17E158654100D1605D3;                 // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part4_9_640ADB403234F17F158654170D1605D4;                 // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sort_12_67E64A803FE2E3C4082C1B1D0AD3AE54;                 // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     icon1_13_0F06170025F25AA8007C99900D0F2AB1;                // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon2_14_0F07174025F25AA9007C99910D0F2AB2;                // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon3_15_0F08178025F25AAA007C99920D0F2AB3;                // 0x0074(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon4_16_0F0917C025F25AAB007C99930D0F2AB4;                // 0x0080(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon0_17_0F0516C025F25AA7007C99970D0F2AB0;                // 0x008C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part0_18_6406DA403234F17B158654130D1605D0;                // 0x0098(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     begin_time_19_4EC9C540305F9139734A98B406F62D25;           // 0x00A4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     preName_20_1C7E12805CF01838148C04270706EB25;              // 0x00B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select0_21_532B8E8068F16B9C06792D01095010C0;         // 0x00BC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select1_22_532C8EC068F16B9D06792D7E095010C1;         // 0x00C8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select2_23_532D8F0068F16B9E06792D7F095010C2;         // 0x00D4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select3_24_532E8F4068F16B9F06792D7C095010C3;         // 0x00E0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select4_25_532F8F8068F16BA006792D7D095010C4;         // 0x00EC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                direction0_26_75D9BCC024DD4F936DA7F138017A5E50;           // 0x00F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction1_27_75DABD0024DD4F946DA7F139017A5E51;           // 0x00FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction2_28_75DBBD4024DD4F956DA7F13E017A5E52;           // 0x0100(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction3_29_75DCBD8024DD4F966DA7F13F017A5E53;           // 0x0104(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction4_30_75DDBDC024DD4F976DA7F13C017A5E54;           // 0x0108(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType0_31_1ED9658079861BCC33E0568D0A371C30;            // 0x010C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType1_32_1EDA65C079861BCD33E0568C0A371C31;            // 0x0110(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType2_33_1EDB660079861BCE33E0568F0A371C32;            // 0x0114(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType3_34_1EDC664079861BCF33E0568E0A371C33;            // 0x0118(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType4_35_1EDD668079861BD033E056F10A371C34;            // 0x011C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal0_36_196B4F00011E674C2F357AE60E069EF0;            // 0x0120(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal1_37_196C4F40011E674D2F357AE50E069EF1;            // 0x0124(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal2_38_196D4F80011E674E2F357AE40E069EF2;            // 0x0128(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal3_39_196E4FC0011E674F2F357AE30E069EF3;            // 0x012C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal4_40_196F5000011E67502F357AE20E069EF4;            // 0x0130(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MeshPath_41_0035070008DE1ED4234ACA510457BB98;             // 0x0134(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

