#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_bp_global_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// ScriptBlueprintGeneratedClass bp_global.bp_global_C
// 0x01B4 (0x04C4 - 0x0310)
class Abp_global_C : public ALuaClassObj
{
public:
	class UScriptContextComponent*                     Generated_ScriptContext;                                  // 0x0310(0x0004) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                BP_Global_Setting_LobbyBgmId;                             // 0x0314(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_IS_EXTERNAL_CHANNEL;                                   // 0x0318(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0319(0x0003) MISSED OFFSET
	int                                                BP_Localize_StringWithNum_id;                             // 0x031C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_GlobalTips_ColorID;                                    // 0x0320(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_GEM_REPORT_PARA2;                                      // 0x0324(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_Localize_StringWithNum_String1;                        // 0x0330(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               BP_GlobalTips_ShowLimitIcon;                              // 0x033C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_IOS_CHECK;                                             // 0x033D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x033E(0x0002) MISSED OFFSET
	float                                              BP_GlobalConfigTempFloatValue_f;                          // 0x0340(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_HadPlayAnimation;                                      // 0x0344(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0345(0x0003) MISSED OFFSET
	int                                                BP_Global_Last_Lobby_Skin_Id;                             // 0x0348(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_Global_AdvertiseNeedShowtask;                          // 0x034C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_Global_Shop_Animation_Open;                            // 0x034D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x034E(0x0002) MISSED OFFSET
	int                                                BP_StartUpType;                                           // 0x0350(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_Global_IsAnniversaryNeedShow;                          // 0x0354(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0355(0x0003) MISSED OFFSET
	int                                                BP_CHECK_MENU_OPEN_ID;                                    // 0x0358(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_Global_Setting_LobbySkinId;                            // 0x035C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_GlobalConfigTempBooleanValue;                          // 0x0360(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0361(0x0003) MISSED OFFSET
	int                                                BP_ChatBan;                                               // 0x0364(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_GLOBAL_USE_ITEM;                                       // 0x0368(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_Localize_StringWithNum_String4;                        // 0x0374(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_Global_AdvertiseUnitID;                                // 0x0380(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BP_GlobalConfigTempStringValue;                           // 0x038C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_Localize_StringWithNum_NumStringIndex;                 // 0x0398(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_Share_Platform;                                        // 0x039C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_GlobalTips_ItemID;                                     // 0x03A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_BA_BUTTON_TYPE;                                        // 0x03A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_Global_TouchTitleString;                               // 0x03A8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_GlobalTips_PatternID;                                  // 0x03B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_GEM_REPORT_SUBEVENT;                                   // 0x03B8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               BP_EUChatRestriction;                                     // 0x03C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x03C5(0x0003) MISSED OFFSET
	int                                                BP_GameGender;                                            // 0x03C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_Global_TouchTipString;                                 // 0x03CC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               BP_GlobalConfigOperateResult;                             // 0x03D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x03D9(0x0003) MISSED OFFSET
	struct FString                                     BP_Global_Url;                                            // 0x03DC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               BP_Global_AndroidKey_IsValid;                             // 0x03E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x03E9(0x0003) MISSED OFFSET
	struct FString                                     BP_GlobalConfigOperateKey;                                // 0x03EC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_CurSceneCameraIndex;                                   // 0x03F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_Global_Cur_Lobby_Skin_Id;                              // 0x03FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_Platform;                                              // 0x0400(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_GlobalSwitchCameraIndex;                               // 0x0404(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BP_Global_ShadowDistanceScale_f;                          // 0x0408(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_Localize_StringWithNum_ReturnStr;                      // 0x040C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_BA_REASON;                                             // 0x0418(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_CHECK_MENU_OPEN_RESULT;                                // 0x041C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x041D(0x0003) MISSED OFFSET
	struct FString                                     BP_Global_RechargePayPos;                                 // 0x0420(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FBP_STRUCT_GlobalTips_Pos                   BP_STRUCT_GlobalTips_Pos;                                 // 0x042C(0x0008) (Edit, BlueprintVisible)
	struct FBP_STRUCT_GlobalTips_TimeInfo              BP_STRUCT_GlobalTips_TimeInfo;                            // 0x0434(0x0010) (Edit, BlueprintVisible)
	bool                                               BP_ShouldRequestChatPrivacy;                              // 0x0444(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x0445(0x0003) MISSED OFFSET
	int                                                BP_Global_CorpsShopLevelForRedPiont;                      // 0x0448(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_IsAppleAudit;                                          // 0x044C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x044D(0x0003) MISSED OFFSET
	int                                                BP_GlobalConfigOperateType;                               // 0x0450(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_GlobalTips_ItemCount;                                  // 0x0454(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_Localize_StringWithNum_String3;                        // 0x0458(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_GlobalHelpTips_StringID;                               // 0x0464(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBP_STRUCT_GlobalHelpTips_Pos               BP_STRUCT_GlobalHelpTips_Pos;                             // 0x0468(0x0008) (Edit, BlueprintVisible)
	int                                                BP_Global_AvatarPreviewTarget;                            // 0x0470(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_Global_SelfUID;                                        // 0x0474(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               BP_Global_HasPufferID;                                    // 0x0480(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x0481(0x0003) MISSED OFFSET
	int                                                BP_GlobalSwitchLobbyMeshBgIndex;                          // 0x0484(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_Global_PreviewItemId;                                  // 0x0488(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_Localize_StringWithNum_String2;                        // 0x048C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              BP_Global_ShadowDistanceScale_Current_f;                  // 0x0498(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_Global_IsResidentEvilNeedShow;                         // 0x049C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_Global_IS_Show_10Animation;                            // 0x049D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBP_STRUCT_NATION_SWITCH                    BP_STRUCT_NATION_SWITCH;                                  // 0x049E(0x0004) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData13[0x2];                                       // 0x04A2(0x0002) MISSED OFFSET
	int                                                BP_GlobalConfigTempIntValue;                              // 0x04A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BP_GEM_REPORT_PARA1;                                      // 0x04A8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BP_Global_BackpackAvatarPreviewID;                        // 0x04B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BP_played_cg;                                             // 0x04B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BP_Global_IsChristmasNeedShow;                            // 0x04BC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x04BD(0x0003) MISSED OFFSET
	class USceneComponent*                             DefaultSceneRoot;                                         // 0x04C0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass *pStaticClass = 0;
		if (!pStaticClass)
			 pStaticClass = UObject::FindClass("ScriptBlueprintGeneratedClass bp_global.bp_global_C");
		return pStaticClass;
	}


	void EventSlapJumpUrl_NoFetch();
	void EventSlapJumpUrl();
	void EventJumpUrl_NoFetch();
	void EventJumpUrl();
	void EventChatCheckBan_NoFetch();
	void EventChatCheckBan();
	void EventSetInfo_Push_NoFetch();
	void EventSetInfo_Push();
	void EventSendBAReport_NoFetch();
	void EventSendBAReport();
	void EventShowPlatQQStartup_NoFetch();
	void EventShowPlatQQStartup();
	void EventShowPlatWXStartup_NoFetch();
	void EventShowPlatWXStartup();
	void EventShowLoadAdvertiseError_NoFetch();
	void EventShowLoadAdvertiseError();
	void EventFetchInfo_NoFetch();
	void EventFetchInfo();
	void EventCheckIfMenuOpen_NoFetch();
	void EventCheckIfMenuOpen();
	void EventOnLobbyRecoverCamera_NoFetch();
	void EventOnLobbyRecoverCamera();
	void EventSwitchLobbySkinCompleted_NoFetch();
	void EventSwitchLobbySkinCompleted();
	void EventGotoItemPreviewPress_NoFetch();
	void EventGotoItemPreviewPress();
	void EventCheckEUChatRestriction_NoFetch();
	void EventCheckEUChatRestriction();
	void EventFetchNationSwitch_NoFetch();
	void EventFetchNationSwitch();
	void EventGlobalCloseItemTips_NoFetch();
	void EventGlobalCloseItemTips();
	void EventAndroidQuitGame_NoFetch();
	void EventAndroidQuitGame();
	void EventGotoItemPreviewClick_NoFetch();
	void EventGotoItemPreviewClick();
	void EventShowPlatIconTips_NoFetch();
	void EventShowPlatIconTips();
	void EventClickLobbyEventGemReport_NoFetch();
	void EventClickLobbyEventGemReport();
	void EventComMsgBoxSluaClickUrl_NoFetch();
	void EventComMsgBoxSluaClickUrl();
	void EventOnLobbyCoverCamera_NoFetch();
	void EventOnLobbyCoverCamera();
	void EventGlobalUseItem_NoFetch();
	void EventGlobalUseItem();
	void EventGlobalShowItemTips_Push_NoFetch();
	void EventGlobalShowItemTips_Push();
	void EventSendClickGemReport_NoFetch();
	void EventSendClickGemReport();
	void EventChatBanInfo_NoFetch();
	void EventChatBanInfo();
	void EventSetPlayedCG_NoFetch();
	void EventSetPlayedCG();
	void UserConstructionScript();
};


}

