#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_GuideText_type.BP_STRUCT_GuideText_type
// 0x004C
struct FBP_STRUCT_GuideText_type
{
	int                                                GuideID_0_A5FF72E542F02CBBCE5E2696B9B5AE1E;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TriggerTimes_1_092A596A4CD84CDBCEAB7CAC1E5C6784;          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     text4_2_0681BED6478BF4BE2672C1B126FF6E1E;                 // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     text1_3_0B618F7F449909BFB58A3E98E3DB73DE;                 // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     text2_4_F5471C1F44A2ADB1B71AD3A2991F2C29;                 // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     text3_5_5E534A744DCD782353B99F94D72CF42E;                 // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsFloat_7_5631F6C015B003AF4D2C60B3037F0B64;               // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShapeType_8_6317EF000ACBA582315244FA09B48A85;             // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                XOffset_10_1D6AFA00689E1E0E6D67A078005D0714;              // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                YOffset_11_5C733A401ADE00450611FA950F5D0704;              // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                OutOffset_12_336A92002DF8BFBC469DDB2F0A823C04;            // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

