#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_GuideFlowCommonDataInfoTb_type.BP_STRUCT_GuideFlowCommonDataInfoTb_type
// 0x002C
struct FBP_STRUCT_GuideFlowCommonDataInfoTb_type
{
	int                                                dataID_0_7D56BA00677CEB1451BE4D8603803C84;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     dataName_1_3CD237004B62867C25B97B9D003D15B5;              // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     dataType_2_139E9F40252CB67925B59689003FF3E5;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                defaultValue_3_004128C04DA72E3515810879001F3245;          // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     eventID_4_796F3C00299505E03C0740E80E43CDE4;               // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

