#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_PetTable_type.BP_STRUCT_PetTable_type
// 0x00C0
struct FBP_STRUCT_PetTable_type
{
	int                                                FoodID2_0_74453B802213AE080C1CFB2A0F6CB952;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PetID_1_161F774025C4024D0658398C0434C1E4;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FoodID3_3_74463BC02213AE090C1CFB2B0F6CB953;               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FoodID1_4_74443B402213AE070C1CFB290F6CB951;               // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PetName_5_0AD5B4406AF7C19B19AAA3EC04C27405;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                FoodCnt_6_0EBF950029CC741A0C1F016A0F6CBE74;               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     JumpUrl_7_78DA5D80770D0FB87D2AB07103CD68BC;               // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                JumpType_8_706CD94059C155B119B58A850CD70355;              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PetMaxLevel_12_15E11B803EA972342741D3080D060EBC;          // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PetImage_14_70AA6CC00734D40B21647D340C1D7495;             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShareBgUrl_15_37E69D80203CAAA43B82F3630BDB729C;           // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                EatAction_16_62B7C7C01B6BC7AD350D95BE014E87DE;            // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ClickAction_17_15DDFAC05B4516070D98AC880B568AFE;          // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DefaultAction_18_336C92801D9FE2845525FDE600CF704E;        // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PetType_19_61A21C803F4E37C81996E96B04C09455;              // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                OnlyPetCamera_22_7FA44EC046AEEDF36970978D00CEEE71;        // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PetAndAvatarCamera_23_070842C07D6093575B47E8000D58A301;   // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BigIconForStore_26_19C65D801F69D0F214C8888304B43EC5;      // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconForStore_27_59F359001081BBCE1F89EEFB04A08715;         // 0x0078(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PetMoodIds_28_69A63FC05650597524C5E6360126C393;           // 0x0084(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PetActionPath_29_6581EEC061F1369711F2C3050CA22638;        // 0x0090(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PetClothPath_30_675355C07747DC3F23E0C98805E173D8;         // 0x009C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PetPath_31_4674174057A3B9CB1992038B04C05C98;              // 0x00A8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PortraitImage_32_418517C028D44DEF7496DBBD05F0BB85;        // 0x00B4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

