#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_VideoTable_type.BP_STRUCT_VideoTable_type
// 0x0028
struct FBP_STRUCT_VideoTable_type
{
	struct FString                                     VideoPath_0_1098BE4009094E9F47A9152E089BE8B8;             // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                VideoState_1_05385B40506E1F73600D2A1709B2A925;            // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FirstPlay_Skip_2_3D50C2400676B2E7577D206F066DF230;        // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Skip_Ctrl_3_066EC0007273ABB4379C3B35027C2C8C;             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VideoID_4_394B1E404B0E5C797DE48E6700189C54;               // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     VideoKey_5_6D6B85404252568D21EE62CE0189D9C9;              // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

