#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MilitaryRankLevel_type.BP_STRUCT_MilitaryRankLevel_type
// 0x0044
struct FBP_STRUCT_MilitaryRankLevel_type
{
	struct FString                                     MilitaryRankName_0_6803185A4F44EE4389F6A3B24C13845F;      // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Exp_1_0727D7694F81C282360C298C96801A35;                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MilitaryRankType_2_F858884B40EBC459D56457B1741D963D;      // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Level_3_756F8DA14F48640682AFFFBD2A052F83;                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MilitaryRankBigIconPath_4_9A4E25B74B0B8657724BD1AD59F3CB7C;// 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MilitaryRankSmallIconPath_5_F068C6BA4EB3CFAFA8CD159178EB8765;// 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MilitaryRankTypeIconPath_6_9AE9634945BC5B59F5709EB9C63E9970;// 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

