#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SegmentProtected_type.BP_STRUCT_SegmentProtected_type
// 0x0034
struct FBP_STRUCT_SegmentProtected_type
{
	struct FString                                     Describe_0_7610ED001E0A6CB6566076E606A97885;              // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconPath_1_15A88A404CAD6D0B5B66F80904709FF8;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_6C034800416770D8124F4EE20A33F774;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Title_3_2ADAC5400345F35B7CAA43E00F61AA15;                 // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ScrollText_4_1998A9C0777720BB02837D3607E79C34;            // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

