#pragma once

// PlayerUnknown's Battle Ground Mobile (1.5.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_NewerGuideTable_type.BP_STRUCT_NewerGuideTable_type
// 0x0014
struct FBP_STRUCT_NewerGuideTable_type
{
	int                                                ID_0_0EE8DE805F860D7E7E52E41C0A59B034;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Start_1_7EF6FEC0759288F12D28E7AB0B140D04;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NeedLevel_2_576FB840768B7F3544DCC9A30E29D6AC;             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SwitchID_3_40191B001DB00B9C2E298F4408532D94;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                End_4_7A2F810047C9E4A077A34E1B059B06E4;                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

