#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_PictorialBookSeasons_type.BP_STRUCT_PictorialBookSeasons_type
// 0x0044
struct FBP_STRUCT_PictorialBookSeasons_type
{
	struct FString                                     SeasonDesc_0_2BEEA3002A53AB26250A5F8808A9A993;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Season_1_5692E34018539A0F3CD1F5690B05089E;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SeasonName_2_65CEA3804B698AEC27BE293D08AA4335;            // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SeasonPoster_3_2048828068E9A6EC65A678900873A262;          // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SeasonTitle_4_067163C019D2FB3F0EE2F7D00A8B5BA5;           // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                JKSwitch_5_119C4AC03C6E605D5E864D1C0E24C018;              // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SeasonPoster2_6_3F614F004AE5297E2B9EC8C6073A26D2;         // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

