#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_corps_race_act_daily_task_table_type.BP_STRUCT_corps_race_act_daily_task_table_type
// 0x0040
struct FBP_STRUCT_corps_race_act_daily_task_table_type
{
	int                                                energy_type_0_45F7B9000B9F2FAC3A2413770B5F3FE5;           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id1_1_1D86924043EBD4772EAFB18005B104E1;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id10_2_3F117E4029F399F92F0DAD100B104E10;             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id11_3_3F127E8029F399FA2F0DAD110B104E11;             // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id12_4_3F137EC029F399FB2F0DAD120B104E12;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id13_5_3F147F0029F399FC2F0DAD130B104E13;             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id14_6_3F157F4029F399FD2F0DAD140B104E14;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id15_7_3F167F8029F399FE2F0DAD150B104E15;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id2_8_1D87928043EBD4782EAFB18105B104E2;              // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id3_9_1D8892C043EBD4792EAFB18205B104E3;              // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id4_10_1D89930043EBD47A2EAFB18305B104E4;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id5_11_1D8A934043EBD47B2EAFB19C05B104E5;             // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id6_12_1D8B938043EBD47C2EAFB19D05B104E6;             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id7_13_1D8C93C043EBD47D2EAFB19E05B104E7;             // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id8_14_1D8D940043EBD47E2EAFB19F05B104E8;             // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id9_15_1D8E944043EBD47F2EAFB19805B104E9;             // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

