#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_character_level_type.BP_STRUCT_character_level_type
// 0x0024
struct FBP_STRUCT_character_level_type
{
	int                                                character_id_0_247B04C04CF1A239591EB7C808135DA4;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                id_1_34F061C04611BD251CBF37BF01B022D4;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                need_exp_2_6B40A0807484A20270805C9C0A0A7F90;              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_3_4CD114803669D4AA107A73AC0230D7BC;                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                unlock_num1_6_145049803A32767640BCB6CC0C503251;           // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                unlock_id1_7_0BAF28C03A8191A3428E68BD05C4F9D1;            // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     unlock_skill_9_65C0910020BE7AB8649588B604D0BBEC;          // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

