#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ActivityCenterConfig_type.BP_STRUCT_ActivityCenterConfig_type
// 0x006C
struct FBP_STRUCT_ActivityCenterConfig_type
{
	int                                                ShowType_0_05733740375524D9752F7B7A0F475AE5;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Condition4_1_2901FD404F76C8BB0434B7C302F17474;            // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Condition6_2_2903FDC04F76C8BD0434B7C102F17476;            // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Condition2_3_28FFFCC04F76C8B90434B7C502F17472;            // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Condition7_4_2904FE004F76C8BE0434B7CE02F17477;            // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Condition1_5_28FEFC804F76C8B80434B7C402F17471;            // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Condition3_6_2900FD004F76C8BA0434B7C202F17473;            // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Condition8_7_2905FE404F76C8BF0434B7CF02F17478;            // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Condition5_8_2902FD804F76C8BC0434B7C002F17475;            // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Type_9_41764F0053D8665E43DBA22C0BFAB045;                  // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SwitchType_10_2C604B80151A18782E38B1A601671E45;           // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

