#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Headportrait_type.BP_STRUCT_Headportrait_type
// 0x0060
struct FBP_STRUCT_Headportrait_type
{
	struct FString                                     Desc_0_400BFEE6409617111ABD269F7FF07B5B;                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Quality_1_67881EA24F1E186A2AF389BBB7C62995;               // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Icon_2_40CD80EB45CBE4311BB919A7C7DAC3AF;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconBig_3_2BDFF0024A49C5707263E986F0AB826B;               // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_4_E5F66BB44E8FF9988F28C38D370137DF;                    // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UnlockType_5_FA4BE0754F644CE090DF7388DEBEFF9F;            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     UnlockDesc_6_1033BFE2476FB300BD448E86EEC3F4C7;            // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                UnlockParam_7_550F64A04DD9EAED9924FF98E01B12EB;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isShow_8_E33D5FA9430ABBA58D44C881AECC498E;                // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0041(0x0003) MISSED OFFSET
	struct FString                                     Name_9_F16C3B4F4884A591B5397DA34A668E9D;                  // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DefaultDisplay_10_4C6C4600503520F476BB02F609D7B029;       // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ShowTime_11_59E76B406521918521EF4BAE0879B025;             // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

