#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_character_skill_type.BP_STRUCT_character_skill_type
// 0x00A0
struct FBP_STRUCT_character_skill_type
{
	int                                                id_0_33E9038013CBFA4A6B82101A0B60D294;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     icon_small_1_15CDB8800A6862782C3ACA9104BCA56C;            // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_big_2_0E333EC047E4789B0D23E8CA03448A67;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_4_3B92F880739CFBB664F0D6D500D32D55;                  // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     desc_5_01B2F800373148106498270B00D2C7F3;                  // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_6_77FB16406813CCF7530D1D4B0D347ABC;                 // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     buffer_7_5EEEEEC035E056BF678C8F2E02F0AC12;                // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     skill_effect_id_10_3B4916003D0BAB4A765AD21E06879E94;      // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     unlock_13_7A78534062D034737082BA7403F0554B;               // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                character_id_14_7A12E6800D1C62AC4E9D52310859AD54;         // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                skill_type_15_74810040522861E16DEC413203D2CAC5;           // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     effect_value1_22_196996C03479FCD35781153C0BBE8C41;        // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     effect_value2_23_196A97003479FCD45781153F0BBE8C42;        // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     disable_mode_ids_20_4AF7CE005BB66364751EF7EB02CBD063;     // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     enable_mode_ids_21_4AC572C02B25D7252E09BA650436C363;      // 0x0088(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_fighting_24_5295E640505ACD2D00C4B52906EBE8A7;        // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

