#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ModeShowConfig_type.BP_STRUCT_ModeShowConfig_type
// 0x00C0
struct FBP_STRUCT_ModeShowConfig_type
{
	int                                                TabID_0_3FF86D805791D4244C52BCEA0B72D544;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Sort_1_10D18E8074FE5F84377358C409B72CA4;                  // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_2_5C8AC7C05B03156D3E9B03390A39B654;                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FPPViewID_3_383AC80012BAA1141A580FAE0654A824;             // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TPPViewID_4_427ACB801CBFDA6257CE70D40654BA24;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HideAutoMatch_5_5A90448075F187407D8A3A0C0D7A8938;         // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MapUseDesc_6_5A62D700158F02826CAA5697052E1EF3;            // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ModeIconPath_8_519F0B4019764D0D33647FED0FACF8E8;          // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Desc_9_204084407DE8A2A5377331E809B626A3;                  // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MapImageInLobby_10_7AD5908032547556282EF0DF096B5E29;      // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MapImage_11_615664C0042405ED2098120A02778065;             // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Name_12_5A2084C05FE36DEB3775BE5E09B7CE05;                 // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MapBg_13_454056401F79CDC34BD58E1A0B7B2717;                // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BgEffect_14_3A0B020009C6754C31DB909301857DA4;             // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ShowDescInLobby_15_79F9784014A34F5323E0FBAD0B14E0B9;      // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     RecruitArrowPath_19_472A0200465BD9DE3BA42C1F097BE1A8;     // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RecruitBarBgPath_20_2E1EEEC0633C8443397FAC59069BE1B8;     // 0x0088(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RecruitIconPath_21_364681803C3E984A4C6CC5AC01621048;      // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsShowMap_22_1FE283403ACCB73D1DB6A57C0A8DDBA0;            // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ModeIcon_23_037E68001A580C62429819070F904F9E;             // 0x00A4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsNew_24_3032BE0011ADC07A4C9AC7510B78E757;                // 0x00B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                EventViewBelong_25_6EADA18069C4519270241107024A9FE7;      // 0x00B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsBeta_26_0B2EB2805B7D7F9E0A0E7134078DB511;               // 0x00B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsClassic_27_32DD0400171AC0AC5D94BB820BB3D123;            // 0x00BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

