#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_corps_race_act_tasks_config_type.BP_STRUCT_corps_race_act_tasks_config_type
// 0x0080
struct FBP_STRUCT_corps_race_act_tasks_config_type
{
	struct FString                                     cond_desc_0_1B8F32807DE1124272A67ABD0636EB33;             // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     cond_desc1_1_224EFEC04C009C4363DE8C3D036EB301;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     cond_desc2_2_224FFF004C009C4463DE8C3C036EB302;            // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     cond_desc3_3_2250FF404C009C4563DE8C3F036EB303;            // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                cond_para1_4_3A800000307ED2CA758B69DB0352F221;            // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cond_para2_5_3A810040307ED2CB758B69DC0352F222;            // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cond_para3_6_3A820080307ED2CC758B69DD0352F223;            // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cond_type1_7_31D307803E3D352C7593A17F03607CE1;            // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cond_type2_8_31D407C03E3D352D7593A17E03607CE2;            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cond_type3_9_31D508003E3D352E7593A17D03607CE3;            // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                daily_limit_10_6640AE40795912BF5B86E3B40E275E84;          // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                score1_11_656A7D401824AD3F04927260056643B1;               // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                score2_12_656B7D801824AD4004927263056643B2;               // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                score3_13_656C7DC01824AD4104927262056643B3;               // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                task_id_14_4319A1C071D9C341197572EE054CC6A4;              // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     task_name_15_787D56C05743E5B73684715B0CC71375;            // 0x005C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     gun_id_list_16_28A6CE404E1C758309B303AC0CE5B244;          // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     match_id_list_17_357D1F003890926822FDF60B03EE1FA4;        // 0x0074(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

