#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_AchievementCondCfg_type.BP_STRUCT_AchievementCondCfg_type
// 0x0038
struct FBP_STRUCT_AchievementCondCfg_type
{
	struct FString                                     Param1_0_47050D40128D80B525DFCB3D014FCDF1;                // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Param2_1_47060D80128D80B625DFCB3C014FCDF2;                // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Desc_3_2170A480766826080289B3240BF08BD3;                  // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_4_370328007EDF2F127BDAF901074BF0F4;                    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Param2ID_5_60B090C07F739D252D5348890FCDF794;              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ProgressDesc_6_64DA39C054D641632DC47F8F0DC7B9E3;          // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

