#pragma once

// PlayerUnknown's Battle Ground Mobile (1.7.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponDIYList_JR_type.BP_STRUCT_WeaponDIYList_JR_type
// 0x0134
struct FBP_STRUCT_WeaponDIYList_JR_type
{
	struct FString                                     begin_time_0_3E6DA4000A58231C3FFF63070DAC9585;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DefaultIcon_1_4B0812C01B0F1DF95CA4808F02B944EE;           // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DefaultStep_2_2CDC578044A3549E5C992FC702B81070;           // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DIYMaxIcon_3_548B84803A6B927C2E8EF1F70024C89E;            // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DIYMaxLayer_4_772741804E1C1D0851BA1A8F025163C2;           // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     icon0_5_2D89D58004B917CE1E3C61AA0AA4A420;                 // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon1_6_2D8AD5C004B917CF1E3C61A90AA4A421;                 // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon2_7_2D8BD60004B917D01E3C61A80AA4A422;                 // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon3_8_2D8CD64004B917D11E3C61970AA4A423;                 // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon4_9_2D8DD68004B917D21E3C61960AA4A424;                 // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_10_4E5A628049A378BA5CF9D55E0063A864;                   // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_11_66F16780456CBBC6661FDA1D03ABF855;                 // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part0_12_028B99003B15D1423D366DFB0ABD8F40;                // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part1_13_028C99403B15D1433D366DF40ABD8F41;                // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part2_14_028D99803B15D1443D366DF50ABD8F42;                // 0x0088(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part3_15_028E99C03B15D1453D366DF60ABD8F43;                // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     part4_16_028F9A003B15D1463D366DF70ABD8F44;                // 0x00A0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sort_17_760E694053F5201F6022DA1103A936F4;                 // 0x00AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     preName_18_16CC114039448EA17AEC888E0C907E85;              // 0x00B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select0_19_2B78AD402C8C423F444C73210408FBB0;         // 0x00BC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select1_20_2B79AD802C8C4240444C73200408FBB1;         // 0x00C8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select2_21_2B7AADC02C8C4241444C73270408FBB2;         // 0x00D4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select3_22_2B7BAE002C8C4242444C73260408FBB3;         // 0x00E0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     icon_select4_23_2B7CAE402C8C4243444C73250408FBB4;         // 0x00EC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                direction0_24_657D9B807C1E154618E04DA20800E6F0;           // 0x00F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction1_25_657E9BC07C1E154718E04DA30800E6F1;           // 0x00FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction2_26_657F9C007C1E154818E04DA40800E6F2;           // 0x0100(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction3_27_65809C407C1E154918E04DA50800E6F3;           // 0x0104(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                direction4_28_65819C807C1E154A18E04DA60800E6F4;           // 0x0108(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType0_29_23B0A4400C5CD8AD2B803EC100A2B5B0;            // 0x010C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType1_30_23B1A4800C5CD8AE2B803EC200A2B5B1;            // 0x0110(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType2_31_23B2A4C00C5CD8AF2B803EC300A2B5B2;            // 0x0114(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType3_32_23B3A5000C5CD8B02B803ECC00A2B5B3;            // 0x0118(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                slotType4_33_23B4A5400C5CD8B12B803ECD00A2B5B4;            // 0x011C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal0_34_1E428DC06418925D4ACA947404913470;            // 0x0120(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal1_35_1E438E006418925E4ACA947704913471;            // 0x0124(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal2_36_1E448E406418925F4ACA947604913472;            // 0x0128(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal3_37_1E458E80641892604ACA947104913473;            // 0x012C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                banDecal4_38_1E468EC0641892614ACA947004913474;            // 0x0130(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

